
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/YamatoKato/st-ecs/actions/runs/11457006104)



<pre><code>Apply complete! Resources: 7 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.aws_iam_policy_document.ecs_assume: Reading...
data.aws_iam_policy_document.ecs_task_assume: Reading...
aws_ecr_repository.ecr_repository: Refreshing state... [id=st-go-web-dev]
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02b5681a4f3c1ab51]
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=1077804475]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=st-go-web-dev]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-01e1db035ad93125b]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0f011103d12fdb225]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0c4e9191b86bacf1f]
aws_security_group.alb: Refreshing state... [id=sg-0a225dea71e25bef2]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-06652e693df02ece1]
aws_security_group.ecs: Refreshing state... [id=sg-00f732263e7b7cfbb]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-00f52ada72fadaee0]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:485368632596:targetgroup/st-go-web-dev-target-group/76d1e770453f2275]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0ad00feb61c4acad5]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-085c4da19a9dd999a]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0db9d38d0fa6b6e5e]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-07e0f7d85c7dcf1cc]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0e4f35268f7682c44]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f343a194803308d3]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-939008187]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-07157bb44b77124e9]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-04105bc1ccc282a1c]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:485368632596:loadbalancer/app/st-go-web-dev-alb/4e29a4c69e8b70f0]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-025e9202f0fa47407]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-026a1d9efb454c7c3]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ebf2d5ecb1d9d0b0]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0402c5a94e6c4dd21]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f343a194803308d31080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0649c434aebf2f5d3]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0a9826f32ca19b694]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-07e0f7d85c7dcf1cc1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0e4f35268f7682c441080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:485368632596:listener/app/st-go-web-dev-alb/4e29a4c69e8b70f0/78a31869aa31e28a]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:485368632596:listener-rule/app/st-go-web-dev-alb/4e29a4c69e8b70f0/78a31869aa31e28a/24e6998cd93abdbd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/st-go-web-dev"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "st-go-web-dev-cluster"
      + tags_all = (known after apply)

      + setting (known after apply)
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "st-go-web-dev"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "st-go-web-dev"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:485368632596:targetgroup/st-go-web-dev-target-group/76d1e770453f2275"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-00f732263e7b7cfbb",
            ]
          + subnets          = [
              + "subnet-00f52ada72fadaee0",
              + "subnet-0f011103d12fdb225",
            ]
        }
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "HEALTH_CHECK_PATH"
                          + value = "/health_checks"
                        },
                      + {
                          + name  = "NGINX_PORT"
                          + value = "8080"
                        },
                    ]
                  + image            = "medpeer/health_check:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/st-go-web-dev"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "st-go-web-dev"
                        }
                    }
                  + name             = "st-go-web-dev"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "st-go-web-dev"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # aws_iam_role.ecs will be created
  + resource "aws_iam_role" "ecs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "st-go-web-dev-ecs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "st-go-web-dev-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_basic will be created
  + resource "aws_iam_role_policy_attachment" "ecs_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "st-go-web-dev-ecs"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
aws_ecs_cluster.ecs_cluster: Creating...
aws_iam_role.ecs: Creating...
aws_cloudwatch_log_group.cloudwatch_log_group: Creating...
aws_iam_role.ecs_task: Creating...
aws_iam_role.ecs: Creation complete after 1s [id=st-go-web-dev-ecs]
aws_iam_role.ecs_task: Creation complete after 1s [id=st-go-web-dev-ecs-task]
aws_iam_role_policy_attachment.ecs_basic: Creating...
aws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 1s [id=/aws/ecs/st-go-web-dev]
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_iam_role_policy_attachment.ecs_basic: Creation complete after 0s [id=st-go-web-dev-ecs-20241022091210867400000001]
aws_ecs_task_definition.ecs_task_definition: Creation complete after 1s [id=st-go-web-dev]
aws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]
aws_ecs_cluster.ecs_cluster: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:485368632596:cluster/st-go-web-dev-cluster]
aws_ecs_service.ecs_service: Creating...
aws_ecs_service.ecs_service: Creation complete after 1s [id=arn:aws:ecs:ap-northeast-1:485368632596:service/st-go-web-dev-cluster/st-go-web-dev]

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":11,"Program":"tfcmt","SHA1":"ca7dba78d4b460ee12d4ce9ba70ffdef6e115af6","Vars":{},"WorkflowName":"Terraform"} -->